docs/1c-export-mobile/MobileAgent/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Залишок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вага</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Целевой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаYouTube</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>127</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бронь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодБрони</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МояБронь</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВидео</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриход</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Открыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СекторНаСкладі</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментар</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВідео</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/Catalogs/ХарактеристикиНоменклатуры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//               |	ХранилищеДополнительнойИнформации.Ссылка
	//               |ИЗ
	//               |	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	//               |ГДЕ
	//               |	ХранилищеДополнительнойИнформации.Характеристика = &Характеристика";
	//Запрос.УстановитьПараметр("Характеристика", Объект.Ссылка);
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
	//	СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Выборка.Ссылка, "Хранилище");
	//КонецЕсли;
	
	Элементы.ДекорацияЮтуб.Доступность = Не ПустаяСтрока(Объект.СсылкаНаYouTube);
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Объект.СсылкаНаYouTube);
КонецПроцедуры


#Если МобильноеПриложениеКлиент Тогда
&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	СтандартнаяОбработка = Ложь;
		
	ТекстСообщения = Общий.ОтправитьНоменклатуруУВайбер(Объект.Ссылка);
	Если ТекстСообщения = Ложь Тогда 
		Сообщить("Не вдалося сформувати текст повідомлення");
	КонецЕсли;
	
	НовВз = Новый ЗапускПриложенияМобильногоУстройства();
	
	НовВз.Действие = "android.intent.action.SEND";
	НовВз.Приложение = "com.viber.voip"; 
	НовВз.ИмяКласса = "com.viber.voip.WelcomeShareActivity"; 
	НовВз.Тип = "text/plain";
	НовВз.ДополнительныеДанные.Добавить("android.intent.extra.TEXT", ТекстСообщения);
	
	НовВз.Запустить(Истина);

КонецПроцедуры

#Иначе
&НаКлиенте
Процедура Декорация2Нажатие(Команда)
	
	ТекстСообщения = Общий.ОтправитьНоменклатуруУВайбер(Объект.Ссылка);
	Если ТекстСообщения = Ложь Тогда 
		Сообщить("Не вдалося сформувати текст повідомлення");
	КонецЕсли;
	
	Сообщить(ТекстСообщения);

КонецПроцедуры
#КонецЕсли


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЦБСектор = Обмен_УправлениеОбменом.ПолучитьСектор(Объект.Ссылка, "");
	Если ЗначениеЗаполнено(ЦБСектор) И ЦБСектор <> Объект.СекторНаСкладі Тогда 
		Объект.СекторНаСкладі = ЦБСектор;
	КонецЕсли;
	
	
	Элементы.Бронь.Видимость = Объект.ПериодБрони > ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ШК(Команда)
	#Если МобильноеПриложениеКлиент Тогда
		
		ОбработчикСканирования = Новый ОписаниеОповещения("ОбработкаСканирования", ЭтаФорма);	
		СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Сканируйте штрихкоды", ОбработчикСканирования);
		
	#Иначе
		СтрокаШК = "";
		Если ВвестиСтроку(СтрокаШК, "Введите ШК вручную") Тогда 
			ОбработкаСканирования(СтрокаШК, Истина, "",);	
		КонецЕсли;
		
	#КонецЕсли
	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСканирования(Штрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт
	Перем ТекстСообщения;
	
	#Если МобильноеПриложениеКлиент Тогда
		СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
	#КонецЕсли
	
	Объект.СекторНаСкладі = Штрихкод;	
	
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Обмен_УправлениеОбменом.ПолучитьСектор(Объект.Ссылка, Объект.СекторНаСкладі);
КонецПроцедуры
